# Loading dependencies

In [1]:
%load_ext sql

In [2]:
%sql sqlite://

'Connected: @None'

# Loans database

In [3]:
%%sql

PRAGMA foreign_keys = ON; -- activates foreign key features in sqlite. It is disabled by default

CREATE TABLE Clients (
    CLIENTNUMBER INTEGER PRIMARY KEY, -- needs to be primary key for foriegn_keys to work
    FIRSTNAME VARCHAR(20),
    SURNAME VARCHAR(20),
    EMAIL VARCHAR(100),
    PHONE VARCHAR(20)

);

CREATE TABLE Loans (
    ACCOUNTNUMBER INT, --A unique integer to identify this account
    CLIENTNUMBER INT, -- An integer to identify the client (clients may have more than one account)
    STARTDATE DATETIME, -- The time that this account was created
    STARTMONTH INT, -- The month for which the first repayment is due (201805 means May 2018)
    TERM INT, -- Over how many months the loan must be repaid
    REMAINING_TERM INT, -- How many months remain
    PRINCIPALDEBT NUMERIC(11, 2), -- The size of the initial loan
    ACCOUNTLIMIT NUMERIC(11, 2), --
    BALANCE NUMERIC(11, 2), -- How much is currently owed
    STATUS VARCHAR(11), -- Human readable status - e.g. "PAID OFF", "ARREARS", "NORMAL"
    FOREIGN KEY (CLIENTNUMBER) REFERENCES Clients(CLIENTNUMBER) -- CLIENTNUMBER is the foreign key from Clients table.
);

INSERT INTO Clients VALUES (1, 'Robert', 'Warren', 'RobertDWarren@teleworm.us', '(251) 546-9442');
INSERT INTO Clients VALUES (2, 'Vincent', 'Brown', 'VincentHBrown@rhyta.com', '(125) 546-4478');
INSERT INTO Clients VALUES (3, 'Janet', 'Prettyman', 'JanetTPrettyman@teleworm.us', '(949) 569-4371');
INSERT INTO Clients VALUES (4, 'Martina', 'Kershner', 'MartinaMKershner@rhyta.com', '(630) 446-8851');
INSERT INTO Clients VALUES (5, 'Tony', 'Schroeder', 'TonySSchroeder@teleworm.us', '(226) 906-2721');
INSERT INTO Clients VALUES (6, 'Harold', 'Grimes', 'HaroldVGrimes@dayrep.com', '(671) 925-1352');

INSERT INTO Loans VALUES (1,1,'2017-11-01 10:00:00', 201712, 36, 35, 10000.00, 15000.00, 9800.00, 'NORMAL');
INSERT INTO Loans VALUES (2,2,'2018-01-01 10:00:00', 201802, 24, 24, 1000.00, 1500.00, 1000.00, 'NORMAL');
INSERT INTO Loans VALUES (3,1,'2016-11-01 10:00:00', 201612, 12, -3, 2000.00, 15000.00, 4985.12, 'ARREARS');
INSERT INTO Loans VALUES (4,3,'2018-01-01 10:00:00', 201802, 24, 24, 3500.00, 5000.00, 1300.00, 'NORMAL');
INSERT INTO Loans VALUES (5,4,'2017-11-01 10:00:00', 201712, 12, 35, 10000.00, 15000.00, 0.00, 'PAID OFF');
INSERT INTO Loans VALUES (6,5,'2018-01-01 10:00:00', 201802, 48, 24, 1000.00, 1500.00, 0.00, 'PAID OFF');
INSERT INTO Loans VALUES (7,6,'2015-11-01 10:00:00', 201512, 12, -20, 10000.00, 15000.00, 9800.00, 'Arrears');
INSERT INTO Loans VALUES (7,4,'2018-01-01 10:00:00', 201802, 12, 1, 2400.00, 3600.00, 130.00, 'NORMAL');

 * sqlite://
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [4]:
%%sql 

SELECT * FROM Clients

 * sqlite://
Done.

[(1, u'Robert', u'Warren', u'RobertDWarren@teleworm.us', u'(251) 546-9442'),
 (2, u'Vincent', u'Brown', u'VincentHBrown@rhyta.com', u'(125) 546-4478'),
 (3, u'Janet', u'Prettyman', u'JanetTPrettyman@teleworm.us', u'(949) 569-4371'),
 (4, u'Martina', u'Kershner', u'MartinaMKershner@rhyta.com', u'(630) 446-8851'),
 (5, u'Tony', u'Schroeder', u'TonySSchroeder@teleworm.us', u'(226) 906-2721'),
 (6, u'Harold', u'Grimes', u'HaroldVGrimes@dayrep.com', u'(671) 925-1352')]

In [5]:
%%sql 

SELECT * FROM Loans

 * sqlite://
Done.

[(1, 1, u'2017-11-01 10:00:00', 201712, 36, 35, 10000, 15000, 9800, u'NORMAL'),
 (2, 2, u'2018-01-01 10:00:00', 201802, 24, 24, 1000, 1500, 1000, u'NORMAL'),
 (3, 1, u'2016-11-01 10:00:00', 201612, 12, -3, 2000, 15000, 4985.12, u'ARREARS'),
 (4, 3, u'2018-01-01 10:00:00', 201802, 24, 24, 3500, 5000, 1300, u'NORMAL'),
 (5, 4, u'2017-11-01 10:00:00', 201712, 12, 35, 10000, 15000, 0, u'PAID OFF'),
 (6, 5, u'2018-01-01 10:00:00', 201802, 48, 24, 1000, 1500, 0, u'PAID OFF'),
 (7, 6, u'2015-11-01 10:00:00', 201512, 12, -20, 10000, 15000, 9800, u'Arrears'),
 (7, 4, u'2018-01-01 10:00:00', 201802, 12, 1, 2400, 3600, 130, u'NORMAL')]

# Tasks

In [ ]:
'''1. Everyone who owes more than $5,000 on an account:'''

In [6]:
%%sql

SELECT FIRSTNAME, SURNAME, BALANCE FROM Loans
    JOIN Clients ON Loans.CLIENTNUMBER = Clients.CLIENTNUMBER
    WHERE BALANCE > 5000.00;

 * sqlite://
Done.

[(u'Robert', u'Warren', 9800), (u'Harold', u'Grimes', 9800)]

In [ ]:
'2. Find all loans older than Jan 2017'

In [7]:
%%sql
SELECT * FROM Loans WHERE STARTDATE < '2017-01-01 00:00:00'

 * sqlite://
Done.

[(3, 1, u'2016-11-01 10:00:00', 201612, 12, -3, 2000, 15000, 4985.12, u'ARREARS'),
 (7, 6, u'2015-11-01 10:00:00', 201512, 12, -20, 10000, 15000, 9800, u'Arrears')]

In [ ]:
'3. Find all clients who have more than one loan'

In [24]:
%%sql
SELECT FIRSTNAME, SURNAME FROM Clients;
JOIN Clients ON Clients.CLIENTNUMBER = Loans.CLIENTNUMBER;
GROUP BY CLIENTNUMBER;
HAVING COUNT(ACCOUNTNUMBER) > 1;

 * sqlite://
Done.
(sqlite3.OperationalError) near "JOIN": syntax error [SQL: u'JOIN Clients ON Clients.CLIENTNUMBER = Loans.CLIENTNUMBER;']

In [ ]:
"4. Find the total balance outstanding over all loans that aren't in arrears"

In [12]:
%%sql
SELECT MAX(BALANCE) FROM Loans WHERE STATUS LIKE "Arrears";

 * sqlite://
Done.
Done.
Done.
Done.

[(9800,)]

In [ ]:
'5. Are all account numbers unique? (How should we fix this in general)'

In [40]:
%%sql

SELECT COUNT(*) FROM Loans;
SELECT DISTINCT ACCOUNTNUMBER FROM Loans;
SELECT COUNT(*) FROM Loans

"""Not, as the initial SELECT COUNT and 
the final SELECT COUNT after running
a SELECT DISTINCT are NOT equal """

 * sqlite://
Done.
Done.
Done.

[(8,)]

In [ ]:
'6. Martina has undergone gender reassignment and is now Martin'

In [41]:
%%sql

UPDATE Clients SET FIRSTNAME='Martin', EMAIL='MartinMKershner@rhyta.com' WHERE CLIENTNUMBER=4;

 * sqlite://
1 rows affected.

[]

In [42]:
%%sql
SELECT * FROM Clients

 * sqlite://
Done.

[(1, u'Robert', u'Warren', u'RobertDWarren@teleworm.us', u'(251) 546-9442'),
 (2, u'Vincent', u'Brown', u'VincentHBrown@rhyta.com', u'(125) 546-4478'),
 (3, u'Janet', u'Prettyman', u'JanetTPrettyman@teleworm.us', u'(949) 569-4371'),
 (4, u'Martin', u'Kershner', u'MartinMKershner@rhyta.com', u'(630) 446-8851'),
 (5, u'Tony', u'Schroeder', u'TonySSchroeder@teleworm.us', u'(226) 906-2721'),
 (6, u'Harold', u'Grimes', u'HaroldVGrimes@dayrep.com', u'(671) 925-1352')]

In [ ]:
'7. Get a list of email addresses for all clients who paid off a loan'

In [45]:
%%sql

SELECT * FROM Loans WHERE STATUS="PAID OFF";
SELECT EMAIL FROM Clients WHERE CLIENTNUMBER=5 ;
SELECT EMAIL FROM Clients WHERE CLIENTNUMBER=4 ;

 * sqlite://
Done.
Done.
Done.

[(u'MartinMKershner@rhyta.com',)]

In [ ]:
'8. Print out the largest loan for each client'

In [47]:
%%sql

SELECT PRINCIPALDEBT, ACCOUNTLIMIT FROM Loans;
ALTER TABLE Loans ADD RATIO varchar(255);

 * sqlite://
Done.
Done.

[]

In [48]:
%%sql
SELECT PRINCIPALDEBT, ACCOUNTLIMIT, RATIO FROM Loans;

 * sqlite://
Done.

[(10000, 15000, None),
 (1000, 1500, None),
 (2000, 15000, None),
 (3500, 5000, None),
 (10000, 15000, None),
 (1000, 1500, None),
 (10000, 15000, None),
 (2400, 3600, None)]

In [69]:
%%sql
UPDATE Loans SET RATIO = (SELECT CAST(PRINCIPALDEBT AS float) / CAST(ACCOUNTLIMIT AS float));

 * sqlite://
8 rows affected.

[]

In [70]:
%%sql
SELECT * FROM Loans

 * sqlite://
Done.

[(1, 1, u'2017-11-01 10:00:00', 201712, 36, 35, 10000, 15000, 9800, u'NORMAL', u'0.666666666666667'),
 (2, 2, u'2018-01-01 10:00:00', 201802, 24, 24, 1000, 1500, 1000, u'NORMAL', u'0.666666666666667'),
 (3, 1, u'2016-11-01 10:00:00', 201612, 12, -3, 2000, 15000, 4985.12, u'ARREARS', u'0.133333333333333'),
 (4, 3, u'2018-01-01 10:00:00', 201802, 24, 24, 3500, 5000, 1300, u'NORMAL', u'0.7'),
 (5, 4, u'2017-11-01 10:00:00', 201712, 12, 35, 10000, 15000, 0, u'PAID OFF', u'0.666666666666667'),
 (6, 5, u'2018-01-01 10:00:00', 201802, 48, 24, 1000, 1500, 0, u'PAID OFF', u'0.666666666666667'),
 (7, 6, u'2015-11-01 10:00:00', 201512, 12, -20, 10000, 15000, 9800, u'Arrears', u'0.666666666666667'),
 (7, 4, u'2018-01-01 10:00:00', 201802, 12, 1, 2400, 3600, 130, u'NORMAL', u'0.666666666666667')]

In [76]:
%%sql
SELECT *,MAX(RATIO) FROM Loans;

 * sqlite://
Done.

[(4, 3, u'2018-01-01 10:00:00', 201802, 24, 24, 3500, 5000, 1300, u'NORMAL', u'0.7', u'0.7')]

# Tasks - vol2

Ride-sharing
You are the founder of a ride-sharing startup and need to design the initial database.

Your startup will be a platform that connects drivers with people who need a lift. You will need to keep track of:

the rides taken,
billing for riders,
monthly payments for drivers.

Design all the SQL tables you need to capture the above requirements.
Write the CREATE TABLE statements to implement your design.
INSERT some example data that you have made up.

In [77]:
%%sql

PRAGMA foreign_keys = ON; -- activates foreign key features in sqlite. It is disabled by default

CREATE TABLE Ride_clients (
    CLIENTNUMBER INTEGER PRIMARY KEY, -- needs to be primary key for foriegn_keys to work
    FIRSTNAME VARCHAR(20),
    SURNAME VARCHAR(20),
    EMAIL VARCHAR(100),
    PHONE VARCHAR(20)
);

CREATE TABLE Rides (
    CLIENTNUMBER INT, 
    RIDEFROM VARCHAR(12),
    RIDETO VARCHAR(12),
    PRICE INT
   );

 * sqlite://
Done.
Done.
Done.

[]

In [78]:
%%sql
INSERT INTO Ride_clients VALUES (1, 'Robert', 'Warren', 'RobertDWarren@teleworm.us', '(251) 546-9442');
INSERT INTO Ride_clients VALUES (2, 'Vincent', 'Brown', 'VincentHBrown@rhyta.com', '(125) 546-4478');
INSERT INTO Ride_clients VALUES (3, 'Janet', 'Prettyman', 'JanetTPrettyman@teleworm.us', '(949) 569-4371');
INSERT INTO Ride_clients VALUES (4, 'Martina', 'Kershner', 'MartinaMKershner@rhyta.com', '(630) 446-8851');
INSERT INTO Ride_clients VALUES (5, 'Tony', 'Schroeder', 'TonySSchroeder@teleworm.us', '(226) 906-2721');
INSERT INTO Ride_clients VALUES (6, 'Harold', 'Grimes', 'HaroldVGrimes@dayrep.com', '(671) 925-1352');

INSERT INTO Rides VALUES (1,'Opole', 'Krakow', 7);
INSERT INTO Rides VALUES (2,'Kluczbork', 'Krakow', 7);
INSERT INTO Rides VALUES (1,'Kluczbork', 'Warszawa', 7);
INSERT INTO Rides VALUES (3,'Poznan', 'Krakow', 7);
INSERT INTO Rides VALUES (4,'Kluczbork', 'Krakow', 7);
INSERT INTO Rides VALUES (5,'Czestochowa', 'Krakow', 7);
INSERT INTO Rides VALUES (6,'Kluczbork', 'Koluszki', 7);
INSERT INTO Rides VALUES (4,'Lublin', 'Krakow', 7);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [79]:
%%sql
SELECT * FROM Ride_clients;

 * sqlite://
Done.

[(1, u'Robert', u'Warren', u'RobertDWarren@teleworm.us', u'(251) 546-9442'),
 (2, u'Vincent', u'Brown', u'VincentHBrown@rhyta.com', u'(125) 546-4478'),
 (3, u'Janet', u'Prettyman', u'JanetTPrettyman@teleworm.us', u'(949) 569-4371'),
 (4, u'Martina', u'Kershner', u'MartinaMKershner@rhyta.com', u'(630) 446-8851'),
 (5, u'Tony', u'Schroeder', u'TonySSchroeder@teleworm.us', u'(226) 906-2721'),
 (6, u'Harold', u'Grimes', u'HaroldVGrimes@dayrep.com', u'(671) 925-1352')]

In [80]:
%%sql
SELECT * FROM Rides;

 * sqlite://
Done.

[(1, u'Opole', u'Krakow', 7),
 (2, u'Kluczbork', u'Krakow', 7),
 (1, u'Kluczbork', u'Warszawa', 7),
 (3, u'Poznan', u'Krakow', 7),
 (4, u'Kluczbork', u'Krakow', 7),
 (5, u'Czestochowa', u'Krakow', 7),
 (6, u'Kluczbork', u'Koluszki', 7),
 (4, u'Lublin', u'Krakow', 7)]